// 题库
const questions = [

    {
        question: "希望を抱くのが間違いだなんて言われたら、私、そんなのは違うって、何度でもそう_____。きっといつまでも言い張れます。",
        options: ["言い渡せます", "言い返せます", "引き渡せます", "取り返せます"],
        answer: 1
    },
    {
        question: "私は雨というものが嫌いです。_____してますし、そこにいるだけで暗い気分になります。",
        options: ["きらきら", "ぺこぺこ", "くよくよ", "じめじめ"],
        answer: 3
    },
    {
        question: "期待する_____むなしいと分かっていても、救いを求め続けた。",
        options: ["しか", "のみ", "だけ", "きり"],
        answer: 2
    },
    {
        question: "_____はいつもひとつ。",
        options: ["充実", "着実", "無実", "真実"],
        answer: 3
    },
    {
        question: "A: 地球にも私が_____か。\nB: 私にとって、あなたは地球の中心です。",
        options: ["含んでいます", "含まれています", "含めています", "含められています"],
        answer: 1
    },
    {
        question: "香澄は有咲をバンドに誘う。しかし、学年一の秀才でありながら、学校もサボりがちなインドア派の有咲の態度は_____。",
        options: ["あどけない", "そっけない", "おっかない", "半端ない"],
        answer: 1
    },
    {
        question: "今日",
        options: ["けふ", "けう", "きやふ", "きやう"],
        answer: 0
    },
    {
        question: "敵は_____にあり",
        options: ["吉祥寺", "西行寺", "花月総持寺", "本能寺"],
        answer: 3
    },
    {
        question: "世の中に、_____ _____ __★__ _____、春の心はのどけからまし。",
        options: ["せば", "絶えて", "なかり", "桜の花"],
        answer: 2
    }
];

while(questions.length < 30) {
    questions.push({
    question: questions.length,
    options:[1,2,3,4],
    answer:0
    });
}